Revit 2024 API
TriangulationInterfaceForTriangulatedSolidOrShell Constructor
 Construct an interface object for a TriangulatedSolidOrShell.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public TriangulationInterfaceForTriangulatedSolidOrShell(
	TriangulatedSolidOrShell externalTriangulatedSolidOrShell
)
Visual Basic
Public Sub New ( _
	externalTriangulatedSolidOrShell As TriangulatedSolidOrShell _
)
Visual C++
public:
TriangulationInterfaceForTriangulatedSolidOrShell(
	TriangulatedSolidOrShell^ externalTriangulatedSolidOrShell
)
Parameters
externalTriangulatedSolidOrShell
Type: Autodesk.Revit.DB.TriangulatedSolidOrShell
 The TriangulatedSolidOrShell that the interface object represents.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
TriangulationInterfaceForTriangulatedSolidOrShell Class
Autodesk.Revit.DB Namespace